zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/drivers/romapi/fsl_romapi.c
    return status;
}

/*!
 * @brief Returns the desired flash property.
 */
status_t FLASH_GetProperty(flash_config_t *config, flash_property_tag_t whichProperty, uint32_t *value)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != config);
    assert(NULL != value);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->flash_get_property(config, whichProperty, value);

    return status;
}
#if defined(__IAR_SYSTEMS_ICC__)
__ramfunc
#elif defined(__GNUC__)
__attribute__ ((section (".ramfunc")))
#endif
    void
    FLASH_CACHE_Disable(void)
{
    /* Unlock SYSCON write access */
    SYSCON->AUTHENTICATE = 0xaaaaaaaa;
    /* Clear the flash cache */
    SYSCON->FMC0_CTRL |= SYSCON_FMC0_CTRL_ECFC(0x1);
    /* Disable flash cache, flash instruction caching and flash data caching */
    SYSCON->FMC0_CTRL |= SYSCON_FMC0_CTRL_DFC(0x1) | SYSCON_FMC0_CTRL_DFIC(0x1) | SYSCON_FMC0_CTRL_DFDC(0x1);
    /* Disable flash speculate and data prefetch */
    SYSCON->FMC0_CTRL |= SYSCON_FMC0_CTRL_DFS(0x1) | SYSCON_FMC0_CTRL_DDP(0x1);

    __ISB();
    __DSB();
}

#if defined(__IAR_SYSTEMS_ICC__)
__ramfunc
#elif defined(__GNUC__)
__attribute__ ((section (".ramfunc")))
#endif
    void
    FLASH_CACHE_Clear(bool isPreProcess)
{
    /* Unlock SYSCON write access */
    SYSCON->AUTHENTICATE = 0xaaaaaaaa;

    if (isPreProcess == false)
    {
        /* Clear the flash cache */
        SYSCON->FMC0_CTRL |= SYSCON_FMC0_CTRL_ECFC(0x1);
        /* Enable flash speculate and data prefetch */
        SYSCON->FMC0_CTRL &= ~(SYSCON_FMC0_CTRL_DFS_MASK | SYSCON_FMC0_CTRL_DDP_MASK);
    }
    else
    {
        /* Disable flash speculate and data prefetch */
        SYSCON->FMC0_CTRL |= SYSCON_FMC0_CTRL_DFS(0x1) | SYSCON_FMC0_CTRL_DDP(0x1);
    }

    /* Memory barriers for good measure.
     * All Cache, Branch predictor and TLB maintenance operations before this instruction complete */
    __ISB();
    __DSB();
}

static status_t flash_check_param(
    flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes, uint32_t alignmentBaseline)
{
    assert(NULL != config);
    assert(NULL != base);

    status_t status = kStatus_FLASH_InvalidArgument;

    if (lengthInBytes == 0U)
    {
        status = kStatus_FLASH_Success;
    }
#if defined(RF_FMU)
    else if ((config == NULL) || (base == NULL) || ((base != FMU0) && (base != RF_FMU)) || (0u == alignmentBaseline))
    {
        status = kStatus_FLASH_InvalidArgument;
    }
#else
    else if ((config == NULL) || (base == NULL) || (base != FMU0) || (0u == alignmentBaseline))
    {
        status = kStatus_FLASH_InvalidArgument;
    }
#endif
    /* Verify the start is alignmentBaseline aligned. */
    else if ((start & (alignmentBaseline - 1U)) != 0u)
    {
        status = kStatus_FLASH_AlignmentError;
    }
    else
    {
        start = start & 0xEFFFFFFFU;

        if (base == FMU0)
        {
            /* Validates the range of the given address */
            if ((start >= config->msf1Config[0].flashDesc.blockBase) &&
                ((start + lengthInBytes) <=
                 (config->msf1Config[0].flashDesc.blockBase + config->msf1Config[0].flashDesc.totalSize)))
            {
                status = kStatus_FLASH_Success;
            }
            else if ((start >= config->msf1Config[0].ifrDesc.pflashIfr0Start) &&
                     ((start + lengthInBytes) <= (config->msf1Config[0].ifrDesc.pflashIfr0Start +
                                                  config->msf1Config[0].ifrDesc.pflashIfr0MemSize)))
            {
                status = kStatus_FLASH_Success;
            }
            else
            {
                status = kStatus_FLASH_AddressError;
            }
        }
        else /* if (base == RF_FMU) */
        {
            /* Validates the range of the given address */
            if ((start >= config->msf1Config[1].flashDesc.blockBase) &&
                ((start + lengthInBytes) <=
                 (config->msf1Config[1].flashDesc.blockBase + config->msf1Config[1].flashDesc.totalSize)))
            {
                status = kStatus_FLASH_Success;
            }
            else if ((start >= config->msf1Config[1].ifrDesc.pflashIfr0Start) &&
                     ((start + lengthInBytes) <= (config->msf1Config[1].ifrDesc.pflashIfr0Start +
                                                  config->msf1Config[1].ifrDesc.pflashIfr0MemSize)))
            {
                status = kStatus_FLASH_Success;
            }
            else
            {
                status = kStatus_FLASH_AddressError;
            }
        }
    }

    return status;
}

/******************************************************
 * IFR driver
 ******************************************************/
/*!
 * @brief Verify that the ifr phrases are erased
 */
status_t FLASH_VerifyEraseIFRPhrase(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != config);
    assert(NULL != base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->ifr_verify_erase_phrase(config, base, start, lengthInBytes);

    return status;
}

/*!
 * @brief Verify that the ifr pages are erased
 */
status_t FLASH_VerifyEraseIFRPage(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != config);
    assert(NULL != base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->ifr_verify_erase_page(config, base, start, lengthInBytes);

    return status;
}

/*!
 * @brief Verify that the ifr sectors are erased
 */
status_t FLASH_VerifyEraseIFRSector(flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t lengthInBytes)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != config);
    assert(NULL != base);

    status_t status;
    status = BOOTLOADER_API_TREE_POINTER->flashDriver->ifr_verify_erase_sector(config, base, start, lengthInBytes);

