zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/drivers/romapi/fsl_romapi.c
    return status;
}

/*!
 * @brief Read IFR into MISR
 *
 * The Read IFR into MISR operation generates a signature based on the contents of the
 * selected IFR space using an embedded MISR.
 */
status_t FLASH_ReadIFRIntoMisr(
    flash_config_t *config, FMU_Type *base, uint32_t start, uint32_t endAddr, uint32_t *seed, uint32_t *signature)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != config);
    assert(NULL != base);
    assert(NULL != seed);
    assert(NULL != signature);

    status_t status;
    status =
        BOOTLOADER_API_TREE_POINTER->flashDriver->ifr_read_into_misr(config, base, start, endAddr, seed, signature);

    return status;
}

/********************************************************************************
 *  Lpspi EEPROM API
 *******************************************************************************/
/*!
 * @brief Initialize SPI NOR/EEPROM
 *
 * @param baudRate Config baudrate for SPI.
 */
status_t SPI_EepromInit(uint32_t baudRate)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    return BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_init(baudRate);
}

/*!
 * @brief Read data via SPI NOR/EEPROM
 */
status_t SPI_EepromRead(uint8_t *dest, uint32_t length, uint32_t address, bool requestFastRead)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != dest);

    return BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_read(dest, length, address, requestFastRead);
}

/*!
 * @brief Write data via SPI NOR/EEPROM
 */
status_t SPI_EepromWrite(uint8_t *data, uint32_t length, uint32_t address)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != data);

    return BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_write(data, length, address);
}

/*!
 * @brief Erase data via SPI NOR/EEPROM
 */
status_t SPI_EepromErase(uint32_t address, eraseOptions_t option)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    return BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_erase(address, option);
}

/*! @brief De-initialize LPSPI
 */
void SPI_EepromFinalize(void)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    BOOTLOADER_API_TREE_POINTER->lpspiFlashDriver->spi_eeprom_finalize();
}

/********************************************************************************
 * Bootloader API
 *******************************************************************************/
/*!
 * @brief This API is used to initialize bootloader and nboot context necessary to process sb3 file format.
 */
status_t KB_Init(void)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    return BOOTLOADER_API_TREE_POINTER->kbApi->kb_init();
}

/*!
 * @brief This API is used to decrypt sb3 file and store signed image contents specified by loader command supported
 * while generating sb3 image through Json configuration. If sb3 file to be processed includes sblaoder command
 * "programFuses" then voltage must be regulated for over-drive and normalize voltage once operation is completed.
 *
 * @param data A Pointer to start of sb file data in memory.
 * @param dataLength sb file data length in bytes.
 * @param isUpdateExt Indicator for update(sb) file start address is in internal or external flash.
 *
 * @retval #kStatus_Success API was executed successfully.
 * @retval #kStatus_Fail API execution failed.
 * @retval #kStatus_InvalidArgument An invalid argument is provided.
 * @retval #kStatus_LPSPI_Busy LPSPI transfer is busy.
 * @retval #kStatusRomLdrDataUnderrun
 */
status_t KB_Execute(const uint8_t *data, uint32_t dataLength, uint32_t isUpdateExt)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != data);

    return BOOTLOADER_API_TREE_POINTER->kbApi->kb_execute(data, dataLength, isUpdateExt);
}

/*!
 * @brief This API is used to release nboot context and finalize sb3 file processing.
 */
status_t KB_Deinit(void)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    return BOOTLOADER_API_TREE_POINTER->kbApi->kb_deinit();
}

/********************************************************************************
 * Interface for image authentication API
 *******************************************************************************/
/*!
 * @brief The function is used for initializing of the nboot context data structure.
 * It should be called prior to any other calls of nboot API.
 */
nboot_status_t NBOOT_ContextInit(nboot_context_t *context)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_context_init(context);
}

/*!
 * @brief The function is used to deinitialize nboot context data structure.
 * Its contents are overwritten with random data so that any sensitive data does not remain in memory.
 */
nboot_status_t NBOOT_ContextFree(nboot_context_t *context)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_context_free(context);
}

/*!
 * @brief Verify NBOOT SB3.1 manifest (header message)
 *
 * This function verifies  the NBOOT SB3.1 manifest, initializes the context and loads keys into the
 * CSS key store so that they can be used by nboot_sb3_load_block function
 * The NBOOT context has to be initialized by the function nboot_context_init before calling this function.
 */
nboot_status_t NBOOT_SB3LoaderManifest(nboot_context_t *context, uint32_t *manifest)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);
    assert(NULL != manifest);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_sb3_load_manifest(context, manifest);
}

/*!
 * @brief Verify NBOOT SB3.1 block
 *
 * This function verifies and decrypts an NBOOT SB3.1 block. Decryption is performed in-place.
 * The NBOOT context has to be initialized by the function nboot_context_init before calling this function.
 */
nboot_status_t NBOOT_SB3LoaderBlock(nboot_context_t *context, uint32_t *block)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);
    assert(NULL != block);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_sb3_load_block(context, block);
}

/*!
 * @brief Secure boot image authentication
 *
 * This function authenticates image with asymmetric cryptography.
 */
nboot_status_t NBOOT_ImgAuthenticateEcdsa(nboot_context_t *context,
                                          uint8_t imageStart[],
                                          nboot_bool_t *isSignatureVerified)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);
    assert(NULL != isSignatureVerified);

