zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC7/drivers/romapi/fsl_romapi.c
    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_img_authenticate_ecdsa(context, imageStart,
                                                                                        isSignatureVerified);
}

/*!
 * @brief Get random number in the highest quality, which is currently avaibale, no delay with TRNG initialization.
 */
nboot_status_t NBOOT_RngRandom(nboot_context_t *context, void *buf, size_t bufLen)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);
    assert(NULL != buf);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_rng_random(context, buf, bufLen);
}

/*!
 * @brief Get high quality random number(s)
 */
nboot_status_t NBOOT_RngRandomHq(nboot_context_t *context, void *buf, size_t bufLen)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);
    assert(NULL != buf);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_rng_random_hq(context, buf, bufLen);
}

/*!
 * @brief Program a fuse word
 * Programs a fuse word at given address with new data.
 */
nboot_status_t NBOOT_FuseProgram(nboot_context_t *context,
                                 uint32_t addr,
                                 uint32_t *data,
                                 uint32_t systemClockFrequencyMHz)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);
    assert(NULL != data);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_fuse_program(context, addr, data,
                                                                              systemClockFrequencyMHz);
}

/*!
 * @brief Reads a fuse word
 * Reads a fuse word.
 */
nboot_status_t NBOOT_FuseRead(nboot_context_t *context, uint32_t addr, uint32_t *data, uint32_t systemClockFrequencyMHz)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);
    assert(NULL != data);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_fuse_read(context, addr, data,
                                                                           systemClockFrequencyMHz);
}

/*!
 * @brief Read property
 * One of the important properties that can be read is the property that last
 * authentication of signed image container has succeeded.
 */
nboot_status_t NBOOT_PropertyGet(nboot_context_t *context, uint32_t propertyId, uint8_t *destData, size_t *dataLen)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);
    assert(NULL != destData);
    assert(NULL != dataLen);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_property_get(context, propertyId, destData, dataLen);
}

/*!
 * @brief Switch ELE to specified secure level access for next command.
 */
nboot_status_t NBOOT_ForceOneShotSecureLevel(nboot_context_t *context, nboot_security_level_t secLvl)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_force_one_shot_secure_level(context, secLvl);
}

/*!
 * @brief Authenticate SB3 header and verifies consistency of blocks.
 *
 * This function authenticates SB3 header and verifies consistency of all data blocks to avoid processing of corrupted
 * data.
 */
nboot_status_t NBOOT_Sb3ConsistencyVerify(nboot_context_t *context, uint8_t sb3Data[], nboot_bool_t *isConsistent)
{
    assert(NULL != BOOTLOADER_API_TREE_POINTER);
    assert(NULL != context);
    assert(NULL != sb3Data);
    assert(NULL != isConsistent);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_sb3_consistency_verify(context, sb3Data, isConsistent);
}